app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT * FROM `courses`

  def edit
    @course = Course.find(params[:id])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)

  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`duration`, `created_at`, `number`, `provider`, `updated_at`, `price`, `outline`, `discount_id`, `title`, `technology_id`) VALUES(5, '2013-06-25 23:17:48', '20410', 'Benchmark Learning', '2013-06-25 23:17:48', 2795, 'Server2012.pdf', 1, 'Installing and Configuring Windows Server 2012', 1)

  def update
    @course = Course.find(params[:id])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)