app/controllers/pages_controller.rb

SELECT * FROM `courses` WHERE (`courses`.`category` = 'Microsoft')
---
  def microsoft
    @course_list = Course.find_all_by_category 'Microsoft'